# # Решение №2
# # Наводим порядок: упорядочиваем курсы по продолжительности

courses = ["Java-разработчик с нуля", "Fullstack-разработчик на Python", "Python-разработчик с нуля", "Frontend-разработчик с нуля"]
mentors = [
 ["Филипп Воронов", "Анна Юшина", "Иван Бочаров", "Анатолий Корсаков", "Юрий Пеньков", "Илья Сухачев", "Иван Маркитан", "Ринат Бибиков", "Вадим Ерошевичев", "Тимур Сейсембаев", "Максим Батырев", "Никита Шумский", "Алексей Степанов", "Денис Коротков", "Антон Глушков", "Сергей Индюков", "Максим Воронцов", "Евгений Грязнов", "Константин Виролайнен", "Сергей Сердюк", "Павел Дерендяев"],
 ["Евгений Шмаргунов", "Олег Булыгин", "Александр Бардин", "Александр Иванов", "Кирилл Табельский", "Александр Ульянцев", "Роман Гордиенко", "Адилет Асканжоев", "Александр Шлейко", "Алена Батицкая", "Денис Ежков", "Владимир Чебукин", "Эдгар Нуруллин", "Евгений Шек", "Максим Филипенко", "Елена Никитина"],
 ["Евгений Шмаргунов", "Олег Булыгин", "Дмитрий Демидов", "Кирилл Табельский", "Александр Ульянцев", "Александр Бардин", "Александр Иванов", "Антон Солонилин", "Максим Филипенко", "Елена Никитина", "Азамат Искаков", "Роман Гордиенко"],
 ["Владимир Чебукин", "Эдгар Нуруллин", "Евгений Шек", "Валерий Хаслер", "Татьяна Тен", "Александр Фитискин", "Александр Шлейко", "Алена Батицкая", "Александр Беспоясов", "Денис Ежков", "Николай Лопин", "Михаил Ларченко"]
]
durations = [14, 20, 12, 20]

courses_list = []
for course, mentor, duration in zip(courses, mentors, durations):
 course_dict = {"title":course, "mentors":mentor, "duration":duration}
 courses_list.append(course_dict)

# Сортируем длительности курсов с сохранением порядковых номеров в courses_list
# Так как lambda-функции ещё не изучались, будем использовать словарь: ключ — duration, значение — исходный номер курса в courses_list
# Могут быть курсы с одинаковой длительностью, поэтому значение словаря — список индексов
durations_dict = {}
for id, course in enumerate(courses_list):
 key = course["duration"]
 durations_dict.setdefault(key, [])
 durations_dict[key].append(id)

# Сортируем словарь по ключам
durations_dict = dict(sorted(durations_dict.items()))

# Выводим курсы, отсортированные по длительности
for duration, ids in durations_dict.items():
  for id in ids:
    course = courses_list[id]
    print(f'{courses_list[id]["title"]} - {duration} месяцев')